HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                      Static Variable Declarations                         */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

/* static EMACData_t xEMACData; */

static ETH_HandleTypeDef xEthHandle;

static EthernetPhy_t xPhyObject;

static TaskHandle_t xEMACTaskHandle = NULL;
static SemaphoreHandle_t xTxMutex = NULL, xTxDescSem = NULL;

static volatile BaseType_t xSwitchRequired = pdFALSE;
static volatile BaseType_t xDropCurrentRxFrame = pdFALSE;

static eMAC_INIT_STATUS_TYPE xMacInitStatus = eMacEthInit;

/* Src Mac Matching */
static uint8_t ucSrcMatchCounters[ niEMAC_MAC_SRC_MATCH_COUNT ] = { 0U };
/* Src Mac Hashing */
static uint32_t ulHashTable[ niEMAC_ADDRESS_HASH_BITS / 32 ];
static uint8_t ucAddrHashCounters[ niEMAC_ADDRESS_HASH_BITS ] = { 0U };

/*---------------------------------------------------------------------------*/

#ifdef niEMAC_CACHEABLE

    static uintptr_t prvGetCacheAlignedRange( const void * pvAddress,
                                              size_t uxLength,
                                              size_t * puxAlignedLength )
    {
        const uintptr_t uxAddress = ( uintptr_t ) pvAddress;
        const uintptr_t uxLineStart = uxAddress & ~( ( uintptr_t ) niEMAC_DATA_ALIGNMENT_MASK );
        const uintptr_t uxLineEnd = ( uxAddress + uxLength + niEMAC_DATA_ALIGNMENT_MASK ) & ~( ( uintptr_t ) niEMAC_DATA_ALIGNMENT_MASK );

        *puxAlignedLength = uxLineEnd - uxLineStart;

        return uxLineStart;
    }

/*---------------------------------------------------------------------------*/

    static void prvCacheCleanByAddr( const void * pvAddress,
                                     size_t uxLength )
    {
        if( ( pvAddress != NULL ) && ( uxLength > 0U ) )
        {
            size_t uxAlignedLength;
            const uintptr_t uxLineStart = prvGetCacheAlignedRange( pvAddress, uxLength, &uxAlignedLength );
            SCB_CleanDCache_by_Addr( ( uint32_t * ) uxLineStart, ( int32_t ) uxAlignedLength );
        }
    }

/*---------------------------------------------------------------------------*/

    static void prvCacheCleanInvalidateByAddr( const void * pvAddress,
                                               size_t uxLength )
    {
        if( ( pvAddress != NULL ) && ( uxLength > 0U ) )
        {
            size_t uxAlignedLength;
            const uintptr_t uxLineStart = prvGetCacheAlignedRange( pvAddress, uxLength, &uxAlignedLength );
            SCB_CleanInvalidateDCache_by_Addr( ( uint32_t * ) uxLineStart, ( int32_t ) uxAlignedLength );
        }
    }

/*---------------------------------------------------------------------------*/

    static void prvCacheInvalidateByAddr( const void * pvAddress,
                                          size_t uxLength )
    {
        if( ( pvAddress != NULL ) && ( uxLength > 0U ) )
        {
            size_t uxAlignedLength;
            const uintptr_t uxLineStart = prvGetCacheAlignedRange( pvAddress, uxLength, &uxAlignedLength );
            SCB_InvalidateDCache_by_Addr( ( uint32_t * ) uxLineStart, ( int32_t ) uxAlignedLength );
        }
    }

#endif /* ifdef niEMAC_CACHEABLE */

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                              Phy Hooks                                    */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

static BaseType_t prvPhyReadReg( BaseType_t xAddress,
                                 BaseType_t xRegister,
                                 uint32_t * pulValue )
{
    BaseType_t xResult = 0;

    if( HAL_ETH_ReadPHYRegister( &xEthHandle, ( uint32_t ) xAddress, ( uint32_t ) xRegister, pulValue ) != HAL_OK )
    {
        xResult = -1;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvPhyWriteReg( BaseType_t xAddress,
                                  BaseType_t xRegister,
                                  uint32_t ulValue )
{
    BaseType_t xResult = 0;

    if( HAL_ETH_WritePHYRegister( &xEthHandle, ( uint32_t ) xAddress, ( uint32_t ) xRegister, ulValue ) != HAL_OK )
    {
        xResult = -1;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                      Network Interface Access Hooks                       */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

static void prvForceRefreshPhyLinkStatus( EthernetPhy_t * pxPhyObject )
{
    vTaskSetTimeOutState( &( pxPhyObject->xLinkStatusTimer ) );
    pxPhyObject->xLinkStatusRemaining = 0U;
    ( void ) xPhyCheckLinkStatus( pxPhyObject, pdFALSE );
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvGetPhyLinkStatus( NetworkInterface_t * pxInterface )
{
    ( void ) pxInterface;

    BaseType_t xReturn = pdFALSE;

    /* const EMACData_t xEMACData = *( ( EMACData_t * ) pxInterface->pvArgument ); */

    if( xPhyObject.ulLinkStatusMask != 0U )
    {
        xReturn = pdTRUE;
    }

    return xReturn;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvNetworkInterfaceInitialise( NetworkInterface_t * pxInterface )
{
    BaseType_t xInitResult = pdFAIL;
    ETH_HandleTypeDef * pxEthHandle = &xEthHandle;
    EthernetPhy_t * pxPhyObject = &xPhyObject;

    switch( xMacInitStatus )
    {
        default:
            configASSERT( pdFALSE );
            break;

        case eMacEthInit:

            if( prvEthConfigInit( pxEthHandle, pxInterface ) == pdFALSE )
            {
                FreeRTOS_debug_printf( ( "prvNetworkInterfaceInitialise: eMacEthInit failed\n" ) );
                break;
            }

