HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*---------------------------------------------------------------------------*/

static void prvAddAllowedMACAddress( NetworkInterface_t * pxInterface,
                                     const uint8_t * pucMacAddress )
{
    ETH_HandleTypeDef * pxEthHandle = &xEthHandle;

    /* TODO: group address filtering with Mask Byte Control */
    BaseType_t xResult = prvAddDestMACAddrMatch( pxEthHandle->Instance, pucMacAddress );

    if( xResult == pdFALSE )
    {
        const uint8_t ucHashIndex = prvGetMacHashIndex( pucMacAddress );

        xResult = prvSetNewDestMACAddrMatch( pxEthHandle->Instance, ucHashIndex, pucMacAddress );

        if( xResult == pdFALSE )
        {
            prvAddDestMACAddrHash( pxEthHandle, ucHashIndex );
        }
    }
}

/*---------------------------------------------------------------------------*/

static void prvRemoveAllowedMACAddress( NetworkInterface_t * pxInterface,
                                        const uint8_t * pucMacAddress )
{
    ETH_HandleTypeDef * pxEthHandle = &xEthHandle;

    const BaseType_t xResult = prvRemoveDestMACAddrMatch( pxEthHandle->Instance, pucMacAddress );

    if( xResult == pdFALSE )
    {
        prvRemoveDestMACAddrHash( pxEthHandle, pucMacAddress );
    }
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                              EMAC Task                                    */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

static BaseType_t prvNetworkInterfaceInput( ETH_HandleTypeDef * pxEthHandle,
                                            NetworkInterface_t * pxInterface )
{
    BaseType_t xResult = pdFALSE;
    UBaseType_t uxCount = 0;

    #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
        NetworkBufferDescriptor_t * pxStartDescriptor = NULL;
        NetworkBufferDescriptor_t * pxEndDescriptor = NULL;
    #endif
    NetworkBufferDescriptor_t * pxCurDescriptor = NULL;

    if( ( xMacInitStatus == eMacInitComplete ) && ( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_STARTED ) )
    {
        for( uint32_t ulChannel = 0; ulChannel < niEMAC_RX_CHANNEL_COUNT; ulChannel++ )
        {
            #if defined( niEMAC_STM32NX )
                pxEthHandle->RxOpCH = ulChannel;
            #endif

            for( ; ; )
            {
                xDropCurrentRxFrame = pdFALSE;
                pxCurDescriptor = NULL;

                if( HAL_ETH_ReadData( pxEthHandle, ( void ** ) &pxCurDescriptor ) != HAL_OK )
                {
                    break;
                }

                ++uxCount;

                if( xDropCurrentRxFrame != pdFALSE )
                {
                    xDropCurrentRxFrame = pdFALSE;
                    configASSERT( pxCurDescriptor == NULL );
                    continue;
                }

                if( pxCurDescriptor == NULL )
                {
                    /* Buffer was dropped, ignore packet */
                    continue;
                }

                if( prvAcceptPacket( pxEthHandle, pxInterface, pxCurDescriptor ) == pdFALSE )
                {
                    prvReleaseNetworkBufferDescriptor( pxCurDescriptor );
                    continue;
                }

                #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
                    pxCurDescriptor->pxNextBuffer = NULL;

                    if( pxStartDescriptor == NULL )
                    {
                        pxStartDescriptor = pxCurDescriptor;
                    }
                    else if( pxEndDescriptor != NULL )
                    {
                        pxEndDescriptor->pxNextBuffer = pxCurDescriptor;
                    }

                    pxEndDescriptor = pxCurDescriptor;
                #else /* if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES ) */
                    prvSendRxEvent( pxCurDescriptor );
                #endif /* if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES ) */
            }
        }

        #if defined( niEMAC_STM32NX )
            pxEthHandle->RxOpCH = niEMAC_DMA_CHANNEL_INDEX;
        #endif
    }

    if( uxCount > 0 )
    {
        #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
            if( pxStartDescriptor != NULL )
            {
                prvSendRxEvent( pxStartDescriptor );
            }
        #endif
        xResult = pdTRUE;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static portTASK_FUNCTION( prvEMACHandlerTask, pvParameters )
{
    NetworkInterface_t * pxInterface = ( NetworkInterface_t * ) pvParameters;
    ETH_HandleTypeDef * pxEthHandle = &xEthHandle;
    EthernetPhy_t * pxPhyObject = &xPhyObject;

    /* iptraceEMAC_TASK_STARTING(); */

    for( ; ; )
    {
        BaseType_t xResult = pdFALSE;
        uint32_t ulISREvents = 0U;

        if( xTaskNotifyWait( 0U, eMacEventAll, &ulISREvents, pdMS_TO_TICKS( niEMAC_TASK_MAX_BLOCK_TIME_MS ) ) == pdTRUE )
        {
            if( ( ulISREvents & eMacEventRx ) != 0 )
            {
                xResult = prvNetworkInterfaceInput( pxEthHandle, pxInterface );
            }

            if( ( ulISREvents & eMacEventTx ) != 0 )
            {
                prvReleaseTxPacket( pxEthHandle );
            }

            if( ( ulISREvents & eMacEventErrRx ) != 0 )
            {
                xResult = prvNetworkInterfaceInput( pxEthHandle, pxInterface );
            }

            if( ( ulISREvents & eMacEventErrTx ) != 0 )
            {
                prvReleaseTxPacket( pxEthHandle );
            }

            if( ( ulISREvents & eMacEventErrDma ) != 0 )
            {
                const uint32_t ulDmaError = HAL_ETH_GetDMAError( pxEthHandle );

                if( ( ( ulDmaError & niEMAC_DMA_TX_BUFFER_UNAVAILABLE_FLAG ) != 0U ) &&
                    ( ( ulISREvents & eMacEventErrTx ) == 0U ) )
                {
                    prvReleaseTxPacket( pxEthHandle );
                }

