HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
    xMACConfig.ChecksumOffload = ( FunctionalState ) ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM );
    xMACConfig.CRCStripTypePacket = DISABLE;
    xMACConfig.AutomaticPadCRCStrip = ENABLE;
    xMACConfig.RetryTransmission = ENABLE;

    if( HAL_ETH_SetMACConfig( pxEthHandle, &xMACConfig ) != HAL_OK )
    {
        FreeRTOS_debug_printf( ( "prvApplyMACDMAConfig: HAL_ETH_SetMACConfig failed\n" ) );
        return pdFALSE;
    }

    ETH_DMAConfigTypeDef xDMAConfig = { 0 };

    if( HAL_ETH_GetDMAConfig( pxEthHandle, &xDMAConfig ) != HAL_OK )
    {
        FreeRTOS_debug_printf( ( "prvApplyMACDMAConfig: HAL_ETH_GetDMAConfig failed\n" ) );
        return pdFALSE;
    }

    #if defined( niEMAC_STM32FX )
        xDMAConfig.EnhancedDescriptorFormat = ( FunctionalState ) ( ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM ) || ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM ) );
    #elif defined( niEMAC_STM32HX )
        xDMAConfig.SecondPacketOperate = ENABLE;
    #elif defined( niEMAC_STM32NX )
        for( uint32_t ulChannel = 0; ulChannel < ETH_DMA_CH_CNT; ulChannel++ )
        {
            xDMAConfig.DMACh[ ulChannel ].SecondPacketOperate = ENABLE;
        }
    #endif /* if defined( niEMAC_STM32FX ) */

    if( HAL_ETH_SetDMAConfig( pxEthHandle, &xDMAConfig ) != HAL_OK )
    {
        FreeRTOS_debug_printf( ( "prvApplyMACDMAConfig: HAL_ETH_SetDMAConfig failed\n" ) );
        return pdFALSE;
    }

    return pdTRUE;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvRecoverFromCriticalError( ETH_HandleTypeDef * pxEthHandle,
                                               EthernetPhy_t * pxPhyObject,
                                               NetworkInterface_t * pxInterface )
{
    BaseType_t xResult = pdFALSE;

    if( ( xTxMutex == NULL ) || ( xTxDescSem == NULL ) ||
        ( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( niEMAC_TX_MAX_BLOCK_TIME_MS ) ) == pdFALSE ) )
    {
        FreeRTOS_debug_printf( ( "prvRecoverFromCriticalError: Failed to take TX mutex\n" ) );
        return pdFALSE;
    }

    xDropCurrentRxFrame = pdFALSE;

    ETH_TxDescListTypeDef * const pxTxDescList = &( niEMAC_TX_DESC_LIST( pxEthHandle, niEMAC_DMA_CHANNEL_INDEX ) );
    UBaseType_t uxBuffersReleased = 0U;

    for( UBaseType_t uxIndex = 0U; uxIndex < ( UBaseType_t ) ETH_TX_DESC_CNT; uxIndex++ )
    {
        NetworkBufferDescriptor_t * const pxDescriptor = ( NetworkBufferDescriptor_t * ) pxTxDescList->PacketAddress[ uxIndex ];

        if( pxDescriptor != NULL )
        {
            pxTxDescList->PacketAddress[ uxIndex ] = NULL;
            prvReleaseNetworkBufferDescriptor( pxDescriptor );
            uxBuffersReleased++;
        }
    }

    pxTxDescList->BuffersInUse = 0U;
    pxTxDescList->releaseIndex = 0U;
    pxTxDescList->CurrentPacketAddress = NULL;

    for( UBaseType_t uxIndex = 0U; uxIndex < uxBuffersReleased; uxIndex++ )
    {
        const BaseType_t xGiveResult = xSemaphoreGive( xTxDescSem );

        configASSERT( xGiveResult == pdTRUE );

        if( xGiveResult == pdFALSE )
        {
            break;
        }
    }

    if( HAL_ETH_Init( pxEthHandle ) != HAL_OK )
    {
        FreeRTOS_debug_printf( ( "prvRecoverFromCriticalError: HAL_ETH_Init failed\n" ) );
    }
    else if( prvApplyMACDMAConfig( pxEthHandle, pxPhyObject ) == pdFALSE )
    {
        FreeRTOS_debug_printf( ( "prvRecoverFromCriticalError: Failed to restore MAC/DMA configuration\n" ) );
    }
    else
    {
        #if defined( niEMAC_STM32HNX )
            prvInitPacketFilter( pxEthHandle, pxInterface );
        #endif

        prvInitMacAddresses( pxEthHandle, pxInterface );
        xResult = pdTRUE;
    }

    ( void ) xSemaphoreGive( xTxMutex );

    return xResult;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvEthConfigInit( ETH_HandleTypeDef * pxEthHandle,
                                    NetworkInterface_t * pxInterface )
{
    BaseType_t xResult = pdFALSE;

    pxEthHandle->Instance = niEMAC_ETH_INSTANCE;
    pxEthHandle->Init.MediaInterface = ipconfigIS_ENABLED( niEMAC_USE_RMII ) ? HAL_ETH_RMII_MODE : HAL_ETH_MII_MODE;
    pxEthHandle->Init.RxBuffLen = niEMAC_DATA_BUFFER_SIZE;

    /* RxBuffLen includes alignment padding, so compare the unpadded frame size
     * against the Ethernet maximum. */
    configASSERT( ipTOTAL_ETHERNET_FRAME_SIZE <= ETH_MAX_PACKET_SIZE );
    configASSERT( pxEthHandle->Init.RxBuffLen >= ipTOTAL_ETHERNET_FRAME_SIZE );
    configASSERT( pxEthHandle->Init.RxBuffLen % 4U == 0 );
    #if defined( niEMAC_STM32NX )
        static ETH_DMADescTypeDef xDMADescTx[ ETH_DMA_TX_CH_CNT ][ ETH_TX_DESC_CNT ] __ALIGNED( niEMAC_DATA_ALIGNMENT ) __attribute__( ( section( niEMAC_TX_DESC_SECTION ) ) );
        static ETH_DMADescTypeDef xDMADescRx[ ETH_DMA_RX_CH_CNT ][ ETH_RX_DESC_CNT ] __ALIGNED( niEMAC_DATA_ALIGNMENT ) __attribute__( ( section( niEMAC_RX_DESC_SECTION ) ) );

        for( uint32_t ulChannel = 0; ulChannel < ETH_DMA_TX_CH_CNT; ulChannel++ )
        {
            configASSERT( ( ( uintptr_t ) xDMADescTx[ ulChannel ] & niEMAC_DATA_ALIGNMENT_MASK ) == 0U );
            pxEthHandle->Init.TxDesc[ ulChannel ] = xDMADescTx[ ulChannel ];
        }

        for( uint32_t ulChannel = 0; ulChannel < ETH_DMA_RX_CH_CNT; ulChannel++ )
        {
            configASSERT( ( ( uintptr_t ) xDMADescRx[ ulChannel ] & niEMAC_DATA_ALIGNMENT_MASK ) == 0U );
            pxEthHandle->Init.RxDesc[ ulChannel ] = xDMADescRx[ ulChannel ];
        }
    #else /* if defined( niEMAC_STM32NX ) */
        static ETH_DMADescTypeDef xDMADescTx[ ETH_TX_DESC_CNT ] __ALIGNED( niEMAC_DATA_ALIGNMENT ) __attribute__( ( section( niEMAC_TX_DESC_SECTION ) ) );
        static ETH_DMADescTypeDef xDMADescRx[ ETH_RX_DESC_CNT ] __ALIGNED( niEMAC_DATA_ALIGNMENT ) __attribute__( ( section( niEMAC_RX_DESC_SECTION ) ) );
        configASSERT( ( ( uintptr_t ) xDMADescTx & niEMAC_DATA_ALIGNMENT_MASK ) == 0U );
        configASSERT( ( ( uintptr_t ) xDMADescRx & niEMAC_DATA_ALIGNMENT_MASK ) == 0U );
        pxEthHandle->Init.TxDesc = xDMADescTx;
        pxEthHandle->Init.RxDesc = xDMADescRx;
    #endif /* if defined( niEMAC_STM32NX ) */
    ( void ) memset( &xDMADescTx, 0, sizeof( xDMADescTx ) );
    ( void ) memset( &xDMADescRx, 0, sizeof( xDMADescRx ) );

    const NetworkEndPoint_t * const pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface );

    if( pxEndPoint != NULL )
    {
        pxEthHandle->Init.MACAddr = ( uint8_t * ) pxEndPoint->xMACAddress.ucBytes;

