HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                           MAC Filtering Helpers                           */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

/* Compute the CRC32 of the given MAC address as per IEEE 802.3 CRC32 */
static uint32_t prvCalcCrc32( const uint8_t * const pucMACAddr )
{
    uint32_t ulCRC32 = 0xFFFFFFFFU;

    uint32_t ucIndex;

    for( ucIndex = ipMAC_ADDRESS_LENGTH_BYTES; ucIndex > 0; --ucIndex )
    {
        ulCRC32 ^= __RBIT( pucMACAddr[ ipMAC_ADDRESS_LENGTH_BYTES - ucIndex ] );

        uint8_t ucJndex;

        for( ucJndex = 8; ucJndex > 0; --ucJndex )
        {
            if( ulCRC32 & 0x80000000U )
            {
                ulCRC32 <<= 1;
                ulCRC32 ^= niEMAC_CRC_POLY;
            }
            else
            {
                ulCRC32 <<= 1;
            }
        }
    }

    return ~ulCRC32;
}

/*---------------------------------------------------------------------------*/

static uint8_t prvGetMacHashIndex( const uint8_t * const pucMACAddr )
{
    const uint32_t ulHash = prvCalcCrc32( pucMACAddr );
    const uint8_t ucHashIndex = ( uint8_t ) ( ( ulHash >> 26 ) & 0x3FU );

    return ucHashIndex;
}

/*---------------------------------------------------------------------------*/

/* Needed since HAL Driver only provides source matching */
static void prvHAL_ETH_SetDestMACAddrMatch( ETH_TypeDef * const pxEthInstance,
                                            uint8_t ucIndex,
                                            const uint8_t * const pucMACAddr )
{
    configASSERT( ucIndex < niEMAC_MAC_SRC_MATCH_COUNT );
    const uint32_t ulMacAddrHigh = ( ( uint32_t ) pucMACAddr[ 5 ] << 8 ) | ( uint32_t ) pucMACAddr[ 4 ];
    const uint32_t ulMacAddrLow = ( ( uint32_t ) pucMACAddr[ 3 ] << 24 ) | ( ( uint32_t ) pucMACAddr[ 2 ] << 16 ) | ( ( uint32_t ) pucMACAddr[ 1 ] << 8 ) | ( uint32_t ) pucMACAddr[ 0 ];

    /* MACA0HR/MACA0LR reserved for the primary MAC-address. */
    const uintptr_t uxMacRegHigh = ( uintptr_t ) &( pxEthInstance->MACA1HR ) + ( 8U * ucIndex );
    const uintptr_t uxMacRegLow = ( uintptr_t ) &( pxEthInstance->MACA1LR ) + ( 8U * ucIndex );
    ( *( __IO uint32_t * ) uxMacRegHigh ) = niEMAC_MAC_ADDRESS_ENABLE_FLAG | ulMacAddrHigh;
    ( *( __IO uint32_t * ) uxMacRegLow ) = ulMacAddrLow;
}

/*---------------------------------------------------------------------------*/

static void prvHAL_ETH_ClearDestMACAddrMatch( ETH_TypeDef * const pxEthInstance,
                                              uint8_t ucIndex )
{
    configASSERT( ucIndex < niEMAC_MAC_SRC_MATCH_COUNT );
    const uintptr_t uxMacRegHigh = ( uintptr_t ) &( pxEthInstance->MACA1HR ) + ( 8U * ucIndex );
    const uintptr_t uxMacRegLow = ( uintptr_t ) &( pxEthInstance->MACA1LR ) + ( 8U * ucIndex );
    ( *( __IO uint32_t * ) uxMacRegHigh ) = 0U;
    ( *( __IO uint32_t * ) uxMacRegLow ) = 0U;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvAddDestMACAddrMatch( ETH_TypeDef * const pxEthInstance,
                                          const uint8_t * const pucMACAddr )
{
    BaseType_t xResult = pdFALSE;

    uint8_t ucIndex;

    for( ucIndex = 0; ucIndex < niEMAC_MAC_SRC_MATCH_COUNT; ++ucIndex )
    {
        if( ucSrcMatchCounters[ ucIndex ] > 0U )
        {
            /* ETH_MACA1HR_MBC - Group Address Filtering */
            const uintptr_t uxMacRegHigh = ( uintptr_t ) &( pxEthInstance->MACA1HR ) + ( 8U * ucIndex );
            const uintptr_t uxMacRegLow = ( uintptr_t ) &( pxEthInstance->MACA1LR ) + ( 8U * ucIndex );

            const uint32_t ulMacAddrHigh = ( ( uint32_t ) pucMACAddr[ 5 ] << 8 ) | ( uint32_t ) pucMACAddr[ 4 ];
            const uint32_t ulMacAddrLow = ( ( uint32_t ) pucMACAddr[ 3 ] << 24 ) | ( ( uint32_t ) pucMACAddr[ 2 ] << 16 ) | ( ( uint32_t ) pucMACAddr[ 1 ] << 8 ) | ( uint32_t ) pucMACAddr[ 0 ];
            const uint32_t ulMacRegHigh = *( __IO uint32_t * ) uxMacRegHigh;
            const uint32_t ulMacRegLow = *( __IO uint32_t * ) uxMacRegLow;

            if( ( ( ulMacRegHigh & 0xFFFFU ) == ulMacAddrHigh ) && ( ulMacRegLow == ulMacAddrLow ) )
            {
                if( ucSrcMatchCounters[ ucIndex ] < UINT8_MAX )
                {
                    ++( ucSrcMatchCounters[ ucIndex ] );
                }

                xResult = pdTRUE;
                break;
            }
        }
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvRemoveDestMACAddrMatch( ETH_TypeDef * const pxEthInstance,
                                             const uint8_t * const pucMACAddr )
{
    BaseType_t xResult = pdFALSE;

    uint8_t ucIndex;

    for( ucIndex = 0; ucIndex < niEMAC_MAC_SRC_MATCH_COUNT; ++ucIndex )
    {
        if( ucSrcMatchCounters[ ucIndex ] > 0U )
        {
            /* ETH_MACA1HR_MBC - Group Address Filtering */
            const uintptr_t uxMacRegHigh = ( uintptr_t ) &( pxEthInstance->MACA1HR ) + ( 8U * ucIndex );
            const uintptr_t uxMacRegLow = ( uintptr_t ) &( pxEthInstance->MACA1LR ) + ( 8U * ucIndex );

            const uint32_t ulMacAddrHigh = ( ( uint32_t ) pucMACAddr[ 5 ] << 8 ) | ( uint32_t ) pucMACAddr[ 4 ];
            const uint32_t ulMacAddrLow = ( ( uint32_t ) pucMACAddr[ 3 ] << 24 ) | ( ( uint32_t ) pucMACAddr[ 2 ] << 16 ) | ( ( uint32_t ) pucMACAddr[ 1 ] << 8 ) | ( uint32_t ) pucMACAddr[ 0 ];
            const uint32_t ulMacRegHigh = *( __IO uint32_t * ) uxMacRegHigh;
            const uint32_t ulMacRegLow = *( __IO uint32_t * ) uxMacRegLow;

            if( ( ( ulMacRegHigh & 0xFFFFU ) == ulMacAddrHigh ) && ( ulMacRegLow == ulMacAddrLow ) )
            {
                if( --( ucSrcMatchCounters[ ucIndex ] ) == 0U )
                {
                    prvHAL_ETH_ClearDestMACAddrMatch( pxEthInstance, ucIndex );
                }

                xResult = pdTRUE;
                break;
            }
        }
    }

    return xResult;
}

