HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*---------------------------------------------------------------------------*/

static BaseType_t prvSetNewDestMACAddrMatch( ETH_TypeDef * const pxEthInstance,
                                             uint8_t ucHashIndex,
                                             const uint8_t * const pucMACAddr )
{
    BaseType_t xResult = pdFALSE;

    if( ucAddrHashCounters[ ucHashIndex ] == 0U )
    {
        uint8_t ucIndex;

        for( ucIndex = 0U; ucIndex < niEMAC_MAC_SRC_MATCH_COUNT; ++ucIndex )
        {
            if( ucSrcMatchCounters[ ucIndex ] == 0U )
            {
                prvHAL_ETH_SetDestMACAddrMatch( pxEthInstance, ucIndex, pucMACAddr );
                ucSrcMatchCounters[ ucIndex ] = 1U;
                xResult = pdTRUE;
                break;
            }
        }
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static void prvAddDestMACAddrHash( ETH_HandleTypeDef * pxEthHandle,
                                   uint8_t ucHashIndex )
{
    if( ucAddrHashCounters[ ucHashIndex ] == 0 )
    {
        if( ucHashIndex & 0x20U )
        {
            ulHashTable[ 1 ] |= ( 1U << ( ucHashIndex & 0x1FU ) );
        }
        else
        {
            ulHashTable[ 0 ] |= ( 1U << ucHashIndex );
        }

        HAL_ETH_SetHashTable( pxEthHandle, ulHashTable );
    }

    if( ucAddrHashCounters[ ucHashIndex ] < UINT8_MAX )
    {
        ++( ucAddrHashCounters[ ucHashIndex ] );
    }
}

/*---------------------------------------------------------------------------*/

static void prvRemoveDestMACAddrHash( ETH_HandleTypeDef * pxEthHandle,
                                      const uint8_t * const pucMACAddr )
{
    const uint8_t ucHashIndex = prvGetMacHashIndex( pucMACAddr );

    if( ucAddrHashCounters[ ucHashIndex ] > 0U )
    {
        if( --( ucAddrHashCounters[ ucHashIndex ] ) == 0U )
        {
            if( ( ucHashIndex & 0x20U ) != 0U )
            {
                ulHashTable[ 1 ] &= ~( 1U << ( ucHashIndex & 0x1FU ) );
            }
            else
            {
                ulHashTable[ 0 ] &= ~( 1U << ucHashIndex );
            }

            ( void ) HAL_ETH_SetHashTable( pxEthHandle, ulHashTable );
        }
    }
}

/*---------------------------------------------------------------------------*/

static void prvResetMACAddressFilters( ETH_HandleTypeDef * pxEthHandle )
{
    ( void ) memset( ucSrcMatchCounters, 0, sizeof( ucSrcMatchCounters ) );
    ( void ) memset( ulHashTable, 0, sizeof( ulHashTable ) );
    ( void ) memset( ucAddrHashCounters, 0, sizeof( ucAddrHashCounters ) );

    if( ( pxEthHandle == NULL ) || ( pxEthHandle->Instance == NULL ) )
    {
        return;
    }

    for( uint8_t ucIndex = 0U; ucIndex < niEMAC_MAC_SRC_MATCH_COUNT; ++ucIndex )
    {
        prvHAL_ETH_ClearDestMACAddrMatch( pxEthHandle->Instance, ucIndex );
    }

    if( HAL_ETH_SetHashTable( pxEthHandle, ulHashTable ) != HAL_OK )
    {
        FreeRTOS_debug_printf( ( "prvResetMACAddressFilters: HAL_ETH_SetHashTable failed\n" ) );
    }
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                              EMAC Helpers                                 */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

static void prvReleaseTxPacket( ETH_HandleTypeDef * pxEthHandle )
{
    if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( niEMAC_TX_MAX_BLOCK_TIME_MS ) ) != pdFALSE )
    {
        uint32_t ulBuffersReleased = 0U;

        #if defined( niEMAC_STM32NX )
            pxEthHandle->TxOpCH = niEMAC_DMA_CHANNEL_INDEX;
        #endif

        /* Each transmission consumes one HAL buffer and one semaphore slot. */
        const uint32_t ulBuffersBeforeRelease = HAL_ETH_GetTxBuffersNumber( pxEthHandle );
        const HAL_StatusTypeDef xReleaseStatus = HAL_ETH_ReleaseTxPacket( pxEthHandle );
        const uint32_t ulBuffersAfterRelease = HAL_ETH_GetTxBuffersNumber( pxEthHandle );

        configASSERT( xReleaseStatus == HAL_OK );
        configASSERT( ulBuffersAfterRelease <= ulBuffersBeforeRelease );

        if( ( xReleaseStatus == HAL_OK ) && ( ulBuffersAfterRelease <= ulBuffersBeforeRelease ) )
        {
            ulBuffersReleased = ulBuffersBeforeRelease - ulBuffersAfterRelease;
        }

        for( uint32_t ulIndex = 0U; ulIndex < ulBuffersReleased; ulIndex++ )
        {
            const BaseType_t xGiveResult = xSemaphoreGive( xTxDescSem );

            configASSERT( xGiveResult == pdTRUE );

            if( xGiveResult != pdTRUE )
            {
                break;
            }
        }

        ( void ) xSemaphoreGive( xTxMutex );
    }
    else
    {
        FreeRTOS_debug_printf( ( "prvReleaseTxPacket: Failed\n" ) );
    }
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvMacUpdateConfig( ETH_HandleTypeDef * pxEthHandle,
                                      EthernetPhy_t * pxPhyObject )
{
    BaseType_t xResult = pdFALSE;

    if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_STARTED )
    {
        ( void ) HAL_ETH_Stop_IT( pxEthHandle );
    }

    #if ipconfigIS_ENABLED( niEMAC_AUTO_NEGOTIATION )
        ( void ) xPhyStartAutoNegotiation( pxPhyObject, xPhyGetMask( pxPhyObject ) );
    #else
        ( void ) xPhyFixedValue( pxPhyObject, xPhyGetMask( pxPhyObject ) );
    #endif

    if( prvApplyMACDMAConfig( pxEthHandle, pxPhyObject ) != pdFALSE )
    {
        xResult = pdTRUE;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static void prvReleaseNetworkBufferDescriptor( NetworkBufferDescriptor_t * const pxDescriptor )
{
    NetworkBufferDescriptor_t * pxDescriptorToClear = pxDescriptor;

    while( pxDescriptorToClear != NULL )
    {
        #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
            NetworkBufferDescriptor_t * const pxNext = pxDescriptorToClear->pxNextBuffer;
        #else
            NetworkBufferDescriptor_t * const pxNext = NULL;
        #endif
        vReleaseNetworkBufferAndDescriptor( pxDescriptorToClear );
        pxDescriptorToClear = pxNext;
    }
}

