HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*---------------------------------------------------------------------------*/

static void prvSendRxEvent( NetworkBufferDescriptor_t * const pxDescriptor )
{
    const IPStackEvent_t xRxEvent =
    {
        .eEventType = eNetworkRxEvent,
        .pvData     = ( void * ) pxDescriptor
    };

    if( xSendEventStructToIPTask( &xRxEvent, pdMS_TO_TICKS( niEMAC_RX_MAX_BLOCK_TIME_MS ) ) != pdPASS )
    {
        iptraceETHERNET_RX_EVENT_LOST();
        FreeRTOS_debug_printf( ( "prvSendRxEvent: xSendEventStructToIPTask failed\n" ) );
        prvReleaseNetworkBufferDescriptor( pxDescriptor );
    }
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvAcceptPacket( ETH_HandleTypeDef * pxEthHandle,
                                   NetworkInterface_t * pxInterface,
                                   NetworkBufferDescriptor_t * pxDescriptor )
{
    BaseType_t xResult = pdFALSE;

    do
    {
        if( ( pxEthHandle == NULL ) || ( pxInterface == NULL ) ||
            ( pxDescriptor == NULL ) || ( pxDescriptor->pucEthernetBuffer == NULL ) )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Invalid argument\n" ) );
            break;
        }

        if( ( pxDescriptor->xDataLength < sizeof( EthernetHeader_t ) ) ||
            ( pxDescriptor->xDataLength > niEMAC_DATA_BUFFER_SIZE ) )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Invalid packet size\n" ) );
            break;
        }

        const EthernetHeader_t * const pxEthernetHeader = ( const EthernetHeader_t * const ) pxDescriptor->pucEthernetBuffer;
        size_t uxMinimumLength = sizeof( EthernetHeader_t );

        switch( pxEthernetHeader->usFrameType )
        {
            #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 )
                case ipARP_FRAME_TYPE:
                    uxMinimumLength = sizeof( ARPPacket_t );
                    break;

                case ipIPv4_FRAME_TYPE:
                    uxMinimumLength = sizeof( IPPacket_t );
                    break;
            #endif

            #if ipconfigIS_ENABLED( ipconfigUSE_IPv6 )
                case ipIPv6_FRAME_TYPE:
                    uxMinimumLength = sizeof( IPPacket_IPv6_t );
                    break;
            #endif

            default:
                break;
        }

        if( pxDescriptor->xDataLength < uxMinimumLength )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Packet too short\n" ) );
            break;
        }

        uint32_t ulErrorCode = 0U;

        if( HAL_ETH_GetRxDataErrorCode( pxEthHandle, &ulErrorCode ) != HAL_OK )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Failed to read Rx data error\n" ) );
            break;
        }

        if( ulErrorCode != 0U )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Rx data error\n" ) );
            break;
        }

        #if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES )
            if( eConsiderFrameForProcessing( pxDescriptor->pucEthernetBuffer ) != eProcessBuffer )
            {
                iptraceETHERNET_RX_EVENT_LOST();
                FreeRTOS_debug_printf( ( "prvAcceptPacket: Frame discarded\n" ) );
                break;
            }
        #endif

        pxDescriptor->pxInterface = pxInterface;
        pxDescriptor->pxEndPoint = FreeRTOS_MatchingEndpoint( pxInterface, pxDescriptor->pucEthernetBuffer );

        if( pxDescriptor->pxEndPoint == NULL )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: No matching endpoint\n" ) );
            break;
        }

        #if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS )
            if( prvPassesPacketFilter( pxDescriptor ) == pdFALSE )
            {
                iptraceETHERNET_RX_EVENT_LOST();
                FreeRTOS_debug_printf( ( "prvAcceptPacket: Packet discarded\n" ) );
                break;
            }
        #endif

        xResult = pdTRUE;
    } while( pdFALSE );

    return xResult;
}

/*---------------------------------------------------------------------------*/

#if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS )

    static BaseType_t prvPassesPacketFilter( const NetworkBufferDescriptor_t * const pxDescriptor )
    {
        const EthernetHeader_t * const pxEthernetHeader = ( const EthernetHeader_t * const ) pxDescriptor->pucEthernetBuffer;
        const NetworkEndPoint_t * const pxEndPoint = pxDescriptor->pxEndPoint;

        #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 )
            if( pxEthernetHeader->usFrameType == ipARP_FRAME_TYPE )
            {
                return pdTRUE;
            }

            if( pxEthernetHeader->usFrameType == ipIPv4_FRAME_TYPE )
            {
                if( ENDPOINT_IS_IPv4( pxEndPoint ) == pdFALSE )
                {
                    return pdFALSE;
                }

                const IPPacket_t * const pxIPPacket = ( const IPPacket_t * const ) pxDescriptor->pucEthernetBuffer;
                const IPHeader_t * const pxIPHeader = &( pxIPPacket->xIPHeader );
                const uint32_t ulDestinationIPAddress = pxIPHeader->ulDestinationIPAddress;
                const uint32_t ulSourceIPAddress = pxIPHeader->ulSourceIPAddress;

                if( ( pxIPHeader->ucVersionHeaderLength < ipIPV4_VERSION_HEADER_LENGTH_MIN ) ||
                    ( pxIPHeader->ucVersionHeaderLength > ipIPV4_VERSION_HEADER_LENGTH_MAX ) )
                {
                    return pdFALSE;
                }

                if( ( ( pxIPHeader->usFragmentOffset & ipFRAGMENT_OFFSET_BIT_MASK ) != 0U ) ||
                    ( ( pxIPHeader->usFragmentOffset & ipFRAGMENT_FLAGS_MORE_FRAGMENTS ) != 0U ) )
                {
                    return pdFALSE;
                }

                if( xBadIPv4Loopback( pxIPHeader ) == pdTRUE )
                {
                    return pdFALSE;
                }

                if( memcmp( xBroadcastMACAddress.ucBytes,
                            pxEthernetHeader->xSourceAddress.ucBytes,
                            sizeof( MACAddress_t ) ) == 0 )
                {
                    return pdFALSE;
                }

