HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
                if( xIsIPv4Multicast( ulSourceIPAddress ) == pdTRUE )
                {
                    return pdFALSE;
                }

                if( FreeRTOS_IsEndPointUp( pxEndPoint ) != pdFALSE )
                {
                    if( ( ulDestinationIPAddress != pxEndPoint->ipv4_settings.ulIPAddress ) &&
                        ( ulDestinationIPAddress != pxEndPoint->ipv4_settings.ulBroadcastAddress ) &&
                        ( ulDestinationIPAddress != FREERTOS_INADDR_BROADCAST ) &&
                        ( xIsIPv4Multicast( ulDestinationIPAddress ) == pdFALSE ) )
                    {
                        return pdFALSE;
                    }

                    if( ( ulSourceIPAddress == pxEndPoint->ipv4_settings.ulBroadcastAddress ) ||
                        ( ulSourceIPAddress == FREERTOS_INADDR_BROADCAST ) )
                    {
                        return pdFALSE;
                    }

                    if( ( memcmp( xBroadcastMACAddress.ucBytes,
                                  pxEthernetHeader->xDestinationAddress.ucBytes,
                                  sizeof( MACAddress_t ) ) == 0 ) &&
                        ( ulDestinationIPAddress != pxEndPoint->ipv4_settings.ulBroadcastAddress ) &&
                        ( ulDestinationIPAddress != FREERTOS_INADDR_BROADCAST ) )
                    {
                        return pdFALSE;
                    }
                }
                else if( memcmp( xBroadcastMACAddress.ucBytes,
                                 pxEthernetHeader->xDestinationAddress.ucBytes,
                                 sizeof( MACAddress_t ) ) == 0 )
                {
                    if( ulDestinationIPAddress != FREERTOS_INADDR_BROADCAST )
                    {
                        return pdFALSE;
                    }
                }
                else if( memcmp( pxEndPoint->xMACAddress.ucBytes,
                                 pxEthernetHeader->xDestinationAddress.ucBytes,
                                 sizeof( MACAddress_t ) ) != 0 )
                {
                    return pdFALSE;
                }

                return pdTRUE;
            }
        #endif /* ipconfigUSE_IPv4 */

        #if ipconfigIS_ENABLED( ipconfigUSE_IPv6 )
            if( pxEthernetHeader->usFrameType == ipIPv6_FRAME_TYPE )
            {
                if( ENDPOINT_IS_IPv6( pxEndPoint ) == pdFALSE )
                {
                    return pdFALSE;
                }

                const IPPacket_IPv6_t * const pxIPv6Packet = ( const IPPacket_IPv6_t * const ) pxDescriptor->pucEthernetBuffer;
                const IPHeader_IPv6_t * const pxIPv6Header = &( pxIPv6Packet->xIPHeader );
                const IPv6_Address_t * const pxDestinationIPAddress = &( pxIPv6Header->xDestinationAddress );
                const IPv6_Address_t * const pxSourceIPAddress = &( pxIPv6Header->xSourceAddress );

                if( ( ( pxIPv6Header->ucVersionTrafficClass & ( uint8_t ) 0xF0U ) >> 4 ) != 6U )
                {
                    return pdFALSE;
                }

                if( ( memcmp( pxDestinationIPAddress->ucBytes, FreeRTOS_in6addr_any.ucBytes, sizeof( IPv6_Address_t ) ) == 0 ) ||
                    ( memcmp( pxSourceIPAddress->ucBytes, FreeRTOS_in6addr_any.ucBytes, sizeof( IPv6_Address_t ) ) == 0 ) )
                {
                    return pdFALSE;
                }

                if( ( xIsIPv6Loopback( pxSourceIPAddress ) == pdTRUE ) ||
                    ( xIsIPv6Loopback( pxDestinationIPAddress ) == pdTRUE ) )
                {
                    return pdFALSE;
                }

                if( ( memcmp( pxDestinationIPAddress->ucBytes,
                              pxEndPoint->ipv6_settings.xIPAddress.ucBytes,
                              sizeof( IPv6_Address_t ) ) != 0 ) &&
                    ( xIsIPv6AllowedMulticast( pxDestinationIPAddress ) == pdFALSE ) &&
                    ( FreeRTOS_IsNetworkUp() != 0 ) )
                {
                    return pdFALSE;
                }

                return pdTRUE;
            }
        #endif /* ipconfigUSE_IPv6 */

        #if ipconfigIS_ENABLED( ipconfigPROCESS_CUSTOM_ETHERNET_FRAMES )
            return pdTRUE;
        #else
            return pdFALSE;
        #endif
    }

#endif /* ipconfigETHERNET_DRIVER_FILTERS_PACKETS */

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                              IRQ Handlers                                 */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

void niEMAC_ETH_IRQ_HANDLER( void )
{
    traceISR_ENTER();

    ETH_HandleTypeDef * pxEthHandle = &xEthHandle;

    xSwitchRequired = pdFALSE;

    if( pxEthHandle->Instance != NULL )
    {
        HAL_ETH_IRQHandler( pxEthHandle );
    }

    portYIELD_FROM_ISR( xSwitchRequired );
}

/*---------------------------------------------------------------------------*/

void HAL_ETH_ErrorCallback( ETH_HandleTypeDef * pxEthHandle )
{
    eMAC_IF_EVENT eErrorEvents = eMacEventNone;
    const uint32_t ulErrorCode = HAL_ETH_GetError( pxEthHandle );

    if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_ERROR )
    {
        /* Fatal bus error occurred */
        eErrorEvents |= eMacEventErrEth;
    }

    if( ( ulErrorCode & niEMAC_DMA_ERROR_MASK ) != 0 )
    {
        eErrorEvents |= eMacEventErrDma;
        const uint32_t ulDmaError = HAL_ETH_GetDMAError( pxEthHandle );

        if( ( ulDmaError & niEMAC_DMA_TX_BUFFER_UNAVAILABLE_FLAG ) != 0 )
        {
            eErrorEvents |= eMacEventErrTx;
        }

        if( ( ulDmaError & niEMAC_DMA_RX_BUFFER_UNAVAILABLE_FLAG ) != 0 )
        {
            eErrorEvents |= eMacEventErrRx;
        }
    }

    if( ( ulErrorCode & HAL_ETH_ERROR_MAC ) != 0 )
    {
        eErrorEvents |= eMacEventErrMac;
    }

    if( ( xEMACTaskHandle != NULL ) && ( eErrorEvents != eMacEventNone ) )
    {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        ( void ) xTaskNotifyFromISR( xEMACTaskHandle, eErrorEvents, eSetBits, &xHigherPriorityTaskWoken );
        xSwitchRequired |= xHigherPriorityTaskWoken;
    }
}

