HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*---------------------------------------------------------------------------*/

void HAL_ETH_RxCpltCallback( ETH_HandleTypeDef * pxEthHandle )
{
    static size_t uxMostRXDescsUsed = 0U;

    for( uint32_t ulChannel = 0; ulChannel < niEMAC_RX_CHANNEL_COUNT; ulChannel++ )
    {
        const size_t uxRxUsed = niEMAC_RX_DESC_LIST( pxEthHandle, ulChannel ).RxDescCnt;

        if( uxMostRXDescsUsed < uxRxUsed )
        {
            uxMostRXDescsUsed = uxRxUsed;
        }
    }

    iptraceNETWORK_INTERFACE_RECEIVE();

    if( xEMACTaskHandle != NULL )
    {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        ( void ) xTaskNotifyFromISR( xEMACTaskHandle, eMacEventRx, eSetBits, &xHigherPriorityTaskWoken );
        xSwitchRequired |= xHigherPriorityTaskWoken;
    }
}

/*---------------------------------------------------------------------------*/

void HAL_ETH_TxCpltCallback( ETH_HandleTypeDef * pxEthHandle )
{
    static size_t uxMostTXDescsUsed = 0U;

    for( uint32_t ulChannel = 0; ulChannel < niEMAC_TX_CHANNEL_COUNT; ulChannel++ )
    {
        const size_t uxTxUsed = niEMAC_TX_DESC_LIST( pxEthHandle, ulChannel ).BuffersInUse;

        if( uxMostTXDescsUsed < uxTxUsed )
        {
            uxMostTXDescsUsed = uxTxUsed;
        }
    }

    iptraceNETWORK_INTERFACE_TRANSMIT();

    if( xEMACTaskHandle != NULL )
    {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        ( void ) xTaskNotifyFromISR( xEMACTaskHandle, eMacEventTx, eSetBits, &xHigherPriorityTaskWoken );
        xSwitchRequired |= xHigherPriorityTaskWoken;
    }
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                            HAL Tx/Rx Callbacks                            */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

void HAL_ETH_RxAllocateCallback( uint8_t ** ppucBuff )
{
    if( ppucBuff == NULL )
    {
        return;
    }

    const NetworkBufferDescriptor_t * pxBufferDescriptor = pxGetNetworkBufferWithDescriptor( niEMAC_DATA_BUFFER_SIZE, pdMS_TO_TICKS( niEMAC_DESCRIPTOR_WAIT_TIME_MS ) );

    if( pxBufferDescriptor != NULL )
    {
        #ifdef niEMAC_CACHEABLE
            if( niEMAC_CACHE_MAINTENANCE != 0 )
            {
                /* The hidden network-buffer pointer can share the first cache
                 * line with the Ethernet payload. Clean it before invalidating
                 * the complete DMA receive range. */
                prvCacheCleanInvalidateByAddr( pxBufferDescriptor->pucEthernetBuffer, niEMAC_DATA_BUFFER_SIZE );
            }
        #endif
        *ppucBuff = pxBufferDescriptor->pucEthernetBuffer;
    }
    else
    {
        FreeRTOS_debug_printf( ( "HAL_ETH_RxAllocateCallback: failed\n" ) );
        *ppucBuff = NULL;
    }
}

/*---------------------------------------------------------------------------*/

void HAL_ETH_RxLinkCallback( void ** ppvStart,
                             void ** ppvEnd,
                             uint8_t * pucBuff,
                             uint16_t usLength )
{
    if( ( ppvStart == NULL ) || ( ppvEnd == NULL ) )
    {
        FreeRTOS_debug_printf( ( "HAL_ETH_RxLinkCallback: Invalid callback context\n" ) );

        if( pucBuff != NULL )
        {
            NetworkBufferDescriptor_t * const pxCurDescriptor = pxPacketBuffer_to_NetworkBuffer( ( const void * ) pucBuff );

            if( pxCurDescriptor != NULL )
            {
                prvReleaseNetworkBufferDescriptor( pxCurDescriptor );
            }
        }

        return;
    }

    if( pucBuff == NULL )
    {
        FreeRTOS_debug_printf( ( "HAL_ETH_RxLinkCallback: NULL buffer pointer\n" ) );
        return;
    }

    NetworkBufferDescriptor_t ** const ppxStartDescriptor = ( NetworkBufferDescriptor_t ** ) ppvStart;
    NetworkBufferDescriptor_t ** const ppxEndDescriptor = ( NetworkBufferDescriptor_t ** ) ppvEnd;
    NetworkBufferDescriptor_t * const pxCurDescriptor = pxPacketBuffer_to_NetworkBuffer( ( const void * ) pucBuff );

    if( pxCurDescriptor == NULL )
    {
        FreeRTOS_debug_printf( ( "HAL_ETH_RxLinkCallback: Invalid buffer descriptor\n" ) );
        return;
    }

    if( ( usLength == 0U ) || ( usLength > niEMAC_DATA_BUFFER_SIZE ) ||
        ( usLength > pxCurDescriptor->xDataLength ) )
    {
        FreeRTOS_debug_printf( ( "HAL_ETH_RxLinkCallback: Invalid buffer length\n" ) );

        if( *ppxStartDescriptor != NULL )
        {
            NetworkBufferDescriptor_t * const pxStartDescriptor = *ppxStartDescriptor;

            *ppxStartDescriptor = NULL;
            *ppxEndDescriptor = NULL;
            prvReleaseNetworkBufferDescriptor( pxStartDescriptor );
        }

        prvReleaseNetworkBufferDescriptor( pxCurDescriptor );
        xDropCurrentRxFrame = pdTRUE;
        return;
    }

    #ifdef niEMAC_CACHEABLE
        if( niEMAC_CACHE_MAINTENANCE != 0 )
        {
            /* Invalidate DMA-written data before the packet or its hidden
             * network-buffer pointer is read by the CPU. */
            prvCacheInvalidateByAddr( pucBuff, usLength );
        }
    #endif

    if( xDropCurrentRxFrame != pdFALSE )
    {
        if( *ppxStartDescriptor != NULL )
        {
            NetworkBufferDescriptor_t * const pxStartDescriptor = *ppxStartDescriptor;

            *ppxStartDescriptor = NULL;
            *ppxEndDescriptor = NULL;
            prvReleaseNetworkBufferDescriptor( pxStartDescriptor );
        }

        prvReleaseNetworkBufferDescriptor( pxCurDescriptor );
        return;
    }

    if( *ppxStartDescriptor != NULL )
    {
        NetworkBufferDescriptor_t * const pxStartDescriptor = *ppxStartDescriptor;

        FreeRTOS_debug_printf( ( "HAL_ETH_RxLinkCallback: Multi-buffer packets are unsupported\n" ) );
        *ppxStartDescriptor = NULL;
        *ppxEndDescriptor = NULL;
        xDropCurrentRxFrame = pdTRUE;
        prvReleaseNetworkBufferDescriptor( pxStartDescriptor );
        prvReleaseNetworkBufferDescriptor( pxCurDescriptor );
        return;
    }

