HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
            GPIO_InitStructure.Pin = ETH_TXD1_Pin;
            HAL_GPIO_Init( ETH_TXD1_Port, &GPIO_InitStructure );

            if( pxEthHandle->Init.MediaInterface == HAL_ETH_RMII_MODE )
            {
                GPIO_InitStructure.Pin = ETH_REF_CLK_Pin;
                HAL_GPIO_Init( ETH_REF_CLK_Port, &GPIO_InitStructure );

                GPIO_InitStructure.Pin = ETH_CRS_DV_Pin;
                HAL_GPIO_Init( ETH_CRS_DV_Port, &GPIO_InitStructure );
            }
            else if( pxEthHandle->Init.MediaInterface == HAL_ETH_MII_MODE )
            {
                GPIO_InitStructure.Pin = ETH_RX_CLK_Pin;
                HAL_GPIO_Init( ETH_RX_CLK_Port, &GPIO_InitStructure );

                GPIO_InitStructure.Pin = ETH_RX_ER_Pin;
                HAL_GPIO_Init( ETH_RX_ER_Port, &GPIO_InitStructure );

                GPIO_InitStructure.Pin = ETH_RX_DV_Pin;
                HAL_GPIO_Init( ETH_RX_DV_Port, &GPIO_InitStructure );

                GPIO_InitStructure.Pin = ETH_RXD2_Pin;
                HAL_GPIO_Init( ETH_RXD2_Port, &GPIO_InitStructure );

                GPIO_InitStructure.Pin = ETH_RXD3_Pin;
                HAL_GPIO_Init( ETH_RXD3_Port, &GPIO_InitStructure );

                GPIO_InitStructure.Pin = ETH_TX_CLK_Pin;
                HAL_GPIO_Init( ETH_TX_CLK_Port, &GPIO_InitStructure );

                GPIO_InitStructure.Pin = ETH_TXD2_Pin;
                HAL_GPIO_Init( ETH_TXD2_Port, &GPIO_InitStructure );

                GPIO_InitStructure.Pin = ETH_TXD3_Pin;
                HAL_GPIO_Init( ETH_TXD3_Port, &GPIO_InitStructure );

                GPIO_InitStructure.Pin = ETH_COL_Pin;
                HAL_GPIO_Init( ETH_COL_Port, &GPIO_InitStructure );

                GPIO_InitStructure.Pin = ETH_CRS_Pin;
                HAL_GPIO_Init( ETH_CRS_Port, &GPIO_InitStructure );
            }

            /* Enable the Ethernet global Interrupt */
            HAL_NVIC_SetPriority( niEMAC_ETH_IRQ_NUMBER, ( uint32_t ) configMAX_SYSCALL_INTERRUPT_PRIORITY, 0 );
            HAL_NVIC_EnableIRQ( niEMAC_ETH_IRQ_NUMBER );
        }
    }

/*---------------------------------------------------------------------------*/

    void HAL_ETH_MspDeInit( ETH_HandleTypeDef * pxEthHandle )
    {
        if( pxEthHandle->Instance == niEMAC_ETH_INSTANCE )
        {
            /* Peripheral clock disable */
            #ifdef niEMAC_STM32FX
                __HAL_RCC_ETH_CLK_DISABLE();
            #elif defined( STM32H5 )
                __HAL_RCC_ETH_CLK_DISABLE();
                __HAL_RCC_ETHTX_CLK_DISABLE();
                __HAL_RCC_ETHRX_CLK_DISABLE();
            #elif defined( STM32H7 ) || defined( STM32H7RS )
                __HAL_RCC_ETH1MAC_CLK_DISABLE();
                __HAL_RCC_ETH1TX_CLK_DISABLE();
                __HAL_RCC_ETH1RX_CLK_DISABLE();
            #elif defined( niEMAC_STM32NX )
                __HAL_RCC_ETH1_CLK_DISABLE();
                __HAL_RCC_ETH1MAC_CLK_DISABLE();
                __HAL_RCC_ETH1TX_CLK_DISABLE();
                __HAL_RCC_ETH1RX_CLK_DISABLE();
            #endif /* ifdef niEMAC_STM32FX */

            /**ETH GPIO Configuration
             * Common Pins
             * ETH_MDC ----------------------> ETH_MDC_Port, ETH_MDC_Pin
             * ETH_MDIO --------------------->
             * ETH_RXD0 --------------------->
             * ETH_RXD1 --------------------->
             * ETH_TX_EN -------------------->
             * ETH_TXD0 --------------------->
             * ETH_TXD1 --------------------->
             *
             * RMII Specific Pins
             * ETH_REF_CLK ------------------>
             * ETH_CRS_DV ------------------->
             *
             * MII Specific Pins
             * ETH_RX_CLK ------------------->
             * ETH_RX_ER -------------------->
             * ETH_RX_DV -------------------->
             * ETH_RXD2 --------------------->
             * ETH_RXD3 --------------------->
             * ETH_TX_CLK ------------------->
             * ETH_TXD2 --------------------->
             * ETH_TXD3 --------------------->
             * ETH_CRS ---------------------->
             * ETH_COL ---------------------->
             */

            HAL_GPIO_DeInit( ETH_MDC_Port, ETH_MDC_Pin );
            HAL_GPIO_DeInit( ETH_MDIO_Port, ETH_MDIO_Pin );
            HAL_GPIO_DeInit( ETH_RXD0_Port, ETH_RXD0_Pin );
            HAL_GPIO_DeInit( ETH_RXD1_Port, ETH_RXD1_Pin );
            HAL_GPIO_DeInit( ETH_TX_EN_Port, ETH_TX_EN_Pin );
            HAL_GPIO_DeInit( ETH_TXD0_Port, ETH_TXD0_Pin );
            HAL_GPIO_DeInit( ETH_TXD1_Port, ETH_TXD1_Pin );

            if( pxEthHandle->Init.MediaInterface == HAL_ETH_RMII_MODE )
            {
                HAL_GPIO_DeInit( ETH_REF_CLK_Port, ETH_REF_CLK_Pin );
                HAL_GPIO_DeInit( ETH_CRS_DV_Port, ETH_CRS_DV_Pin );
            }
            else if( pxEthHandle->Init.MediaInterface == HAL_ETH_MII_MODE )
            {
                HAL_GPIO_DeInit( ETH_RX_CLK_Port, ETH_RX_CLK_Pin );
                HAL_GPIO_DeInit( ETH_RX_ER_Port, ETH_RX_ER_Pin );
                HAL_GPIO_DeInit( ETH_RX_DV_Port, ETH_RX_DV_Pin );
                HAL_GPIO_DeInit( ETH_RXD2_Port, ETH_RXD2_Pin );
                HAL_GPIO_DeInit( ETH_RXD3_Port, ETH_RXD3_Pin );
                HAL_GPIO_DeInit( ETH_TX_CLK_Port, ETH_TX_CLK_Pin );
                HAL_GPIO_DeInit( ETH_TXD2_Port, ETH_TXD2_Pin );
                HAL_GPIO_DeInit( ETH_TXD3_Port, ETH_TXD3_Pin );
                HAL_GPIO_DeInit( ETH_COL_Port, ETH_COL_Pin );
                HAL_GPIO_DeInit( ETH_CRS_Port, ETH_CRS_Pin );
            }

            /* ETH interrupt Deinit */
            HAL_NVIC_DisableIRQ( niEMAC_ETH_IRQ_NUMBER );
        }
    }

/*---------------------------------------------------------------------------*/

    #if defined( __MPU_PRESENT ) && ( __MPU_PRESENT == 1U )

        void MPU_Config( void )
        {
            MPU_Region_InitTypeDef MPU_InitStruct = { 0 };

            HAL_MPU_Disable();

            extern uint8_t __ETH_BUFFERS_START;

